bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/bl702l_hbn.h
/**
  ******************************************************************************
  * @file    bl702l_hbn.h
  * @version V1.0
  * @date
  * @brief   This file is the standard driver header file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __BL702L_HBN_H__
#define __BL702L_HBN_H__

#include "hbn_reg.h"
#include "bl702l_aon.h"
#include "bl702l_common.h"
#include "bflb_sflash.h"

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup  BL702L_Peripheral_Driver
 *  @{
 */

/** @addtogroup  HBN
 *  @{
 */

/** @defgroup  HBN_Public_Types
 *  @{
 */

/**
 *  @brief HBN PIR interrupt configuration type definition
 */
typedef struct
{
    BL_Fun_Type lowIntEn;  /*!< Low will trigger interrupt */
    BL_Fun_Type highIntEn; /*!< High will trigger interrupt */
} HBN_PIR_INT_CFG_Type;

/**
 *  @brief HBN PIR low pass filter type definition
 */
enum {
    HBN_PIR_LPF_DIV1, /*!< HBN PIR lpf div 1 */
    HBN_PIR_LPF_DIV2, /*!< HBN PIR lpf div 2 */
};
typedef BL_ENUM_Type HBN_PIR_LPF_Type;

/**
 *  @brief HBN PIR high pass filter type definition
 */
enum {
    HBN_PIR_HPF_METHOD0, /*!< HBN PIR hpf calc method 0, 1-z^-1 */
    HBN_PIR_HPF_METHOD1, /*!< HBN PIR hpf calc method 1, 1-z^-2 */
    HBN_PIR_HPF_METHOD2, /*!< HBN PIR hpf calc method 2, 1-z^-3 */
};
typedef BL_ENUM_Type HBN_PIR_HPF_Type;

/**
 *  @brief HBN BOR threshold type definition
 */
enum {
    HBN_BOR_THRES_1P80V, /*!< BOR threshold 1.80V */
    HBN_BOR_THRES_1P85V, /*!< BOR threshold 1.85V */
    HBN_BOR_THRES_1P90V, /*!< BOR threshold 1.90V */
    HBN_BOR_THRES_1P95V, /*!< BOR threshold 1.95V */
    HBN_BOR_THRES_2P00V, /*!< BOR threshold 2.00V */
    HBN_BOR_THRES_2P05V, /*!< BOR threshold 2.05V */
    HBN_BOR_THRES_2P10V, /*!< BOR threshold 2.10V */
    HBN_BOR_THRES_2P15V, /*!< BOR threshold 2.15V */
};
typedef BL_ENUM_Type HBN_BOR_THRES_Type;

/**
 *  @brief HBN BOR mode type definition
 */
enum {
    HBN_BOR_MODE_POR_INDEPENDENT, /*!< POR is independent of BOR */
    HBN_BOR_MODE_POR_RELEVANT,    /*!< POR is relevant to BOR */
};
typedef BL_ENUM_Type HBN_BOR_MODE_Type;

/**
 *  @brief HBN 32K clock type definition
 */
enum {
    HBN_32K_RC = 0,  /*!< HBN use rc 32k */
    HBN_32K_XTAL,    /*!< HBN use xtal 32k */
    HBN_32K_DIG = 3, /*!< HBN use dig 32k */
};
typedef BL_ENUM_Type HBN_32K_CLK_Type;

/**
 *  @brief HBN xclk clock type definition
 */
enum {
    HBN_XCLK_CLK_RC32M, /*!< use RC32M as xclk clock */
    HBN_XCLK_CLK_XTAL,  /*!< use XTAL as xclk clock */
};
typedef BL_ENUM_Type HBN_XCLK_CLK_Type;

/**
 *  @brief HBN root clock type definition
 */
enum {
    HBN_ROOT_CLK_RC32M, /*!< use RC32M as root clock */
    HBN_ROOT_CLK_XTAL,  /*!< use XTAL as root clock */
    HBN_ROOT_CLK_DLL,   /*!< use DLL as root clock */
};
typedef BL_ENUM_Type HBN_ROOT_CLK_Type;

/**
 *  @brief HBN UART clock type definition
 */
enum {
    HBN_UART_CLK_FCLK = 0, /*!< Select FCLK as UART clock */
    HBN_UART_CLK_64M,      /*!< Select 64M as UART clock */
    HBN_UART_CLK_XCLK,     /*!< Select XCLK as UART clock */
};
typedef BL_ENUM_Type HBN_UART_CLK_Type;

/**
 *  @brief HBN RTC interrupt delay type definition
 */
enum {
    HBN_RTC_INT_DELAY_32T = 0, /*!< HBN RTC interrupt delay 32T */
    HBN_RTC_INT_DELAY_0T = 1,  /*!< HBN RTC interrupt delay 0T */
};
typedef BL_ENUM_Type HBN_RTC_INT_Delay_Type;

/**
 *  @brief HBN aon pad type definition
 */
enum {
    HBN_AON_PAD_GPIO9 = 0,  /*!< HBN aon pad type: GPIO16 */
    HBN_AON_PAD_GPIO10 = 1, /*!< HBN aon pad type: GPIO17 */
    HBN_AON_PAD_GPIO11 = 2, /*!< HBN aon pad type: GPIO18 */
    HBN_AON_PAD_GPIO12 = 3, /*!< HBN aon pad type: GPIO19 */
    HBN_AON_PAD_GPIO13 = 4, /*!< HBN aon pad type: GPIO19 */
    HBN_AON_PAD_GPIO30 = 5, /*!< HBN aon pad type: GPIO19 */
    HBN_AON_PAD_GPIO31 = 6, /*!< HBN aon pad type: GPIO19 */
};
typedef BL_ENUM_Type HBN_AON_PAD_Type;

/**
 *  @brief HBN interrupt type definition
 */
enum {
    HBN_INT_GPIO9 = 0,   /*!< HBN interrupt type: GPIO9 */
    HBN_INT_GPIO10 = 1,  /*!< HBN interrupt type: GPIO10 */
    HBN_INT_GPIO11 = 2,  /*!< HBN interrupt type: GPIO11 */
    HBN_INT_GPIO12 = 3,  /*!< HBN interrupt type: GPIO12 */
    HBN_INT_GPIO13 = 4,  /*!< HBN interrupt type: GPIO13 */
    HBN_INT_GPIO30 = 5,  /*!< HBN interrupt type: GPIO30 */
    HBN_INT_GPIO31 = 6,  /*!< HBN interrupt type: GPIO31 */
    HBN_INT_GPIO8 = 7,   /*!< HBN interrupt type: GPIO8 */
    HBN_INT_GPIO14 = 8,  /*!< HBN interrupt type: GPIO14 */
    HBN_INT_GPIO22 = 9,  /*!< HBN interrupt type: GPIO22 */
    HBN_INT_RTC = 16,    /*!< HBN interrupt type: RTC */
    HBN_INT_BOD = 18,    /*!< HBN interrupt type: BOR */
    HBN_INT_ACOMP0 = 20, /*!< HBN interrupt type: ACOMP0 */
    HBN_INT_ACOMP1 = 22, /*!< HBN interrupt type: ACOMP1 */
};
