bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/bl702l_hbn.h
typedef BL_ENUM_Type HBN_INT_Type;

/**
 *  @brief HBN acomp interrupt type definition
 */
enum {
    HBN_ACOMP_INT_EDGE_POSEDGE = 1,         /*!< HBN acomp interrupt edge posedge */
    HBN_ACOMP_INT_EDGE_NEGEDGE = 2,         /*!< HBN acomp interrupt edge negedge */
    HBN_ACOMP_INT_EDGE_POSEDGE_NEGEDGE = 3, /*!< HBN acomp interrupt edge posedge and negedge */
};
typedef BL_ENUM_Type HBN_ACOMP_INT_EDGE_Type;

/**
 *  @brief HBN reset event type definition
 */
enum {
    HBN_RST_EVENT_POR_OUT,   /*!< por_out event */
    HBN_RST_EVENT_EXT_RST_N, /*!< ext_rst_n event */
    HBN_RST_EVENT_SW_RST,    /*!< sw_rst event */
    HBN_RST_EVENT_PWR_RST_N, /*!< pwr_rst_n event */
    HBN_RST_EVENT_BOR_OUT,   /*!< bor_out_ event */
};
typedef BL_ENUM_Type HBN_RST_EVENT_Type;

/**
 *  @brief HBN AON PAD configuration type definition
 */
typedef struct
{
    uint8_t ctrlEn;   /*!< AON PAD Control by AON HW */
    uint8_t ie;       /*!< Always on PAD IE/SMT (if corresponding  AON GPIO controlled by AON HW) */
    uint8_t oe;       /*!< Always on PAD OE (if corresponding  AON GPIO controlled by AON HW)     */
    uint8_t pullUp;   /*!< Always on PAD PU (if corresponding  AON GPIO controlled by AON HW)     */
    uint8_t pullDown; /*!< Always on PAD PD (if corresponding  AON GPIO controlled by AON HW)     */
} HBN_AON_PAD_CFG_Type;

/**
 *  @brief HBN GPIO interrupt trigger type definition
 */
enum {
    HBN_GPIO_INT_TRIGGER_SYNC_FALLING_EDGE,  /*!< HBN GPIO INT trigger type: sync falling edge trigger */
    HBN_GPIO_INT_TRIGGER_SYNC_RISING_EDGE,   /*!< HBN GPIO INT trigger type: sync rising edge trigger */
    HBN_GPIO_INT_TRIGGER_SYNC_LOW_LEVEL,     /*!< HBN GPIO INT trigger type: sync low level trigger */
    HBN_GPIO_INT_TRIGGER_SYNC_HIGH_LEVEL,    /*!< HBN GPIO INT trigger type: sync high level trigger */
    HBN_GPIO_INT_TRIGGER_ASYNC_FALLING_EDGE, /*!< HBN GPIO INT trigger type: async falling edge trigger */
    HBN_GPIO_INT_TRIGGER_ASYNC_RISING_EDGE,  /*!< HBN GPIO INT trigger type: async rising edge trigger */
    HBN_GPIO_INT_TRIGGER_ASYNC_LOW_LEVEL,    /*!< HBN GPIO INT trigger type: async low level trigger */
    HBN_GPIO_INT_TRIGGER_ASYNC_HIGH_LEVEL,   /*!< HBN GPIO INT trigger type: async high level trigger */
};
typedef BL_ENUM_Type HBN_GPIO_INT_Trigger_Type;

/**
 *  @brief HBN OUT0 interrupt type definition
 */
enum {
    HBN_OUT0_INT_GPIO9 = 0,  /*!< HBN out 0 interrupt type: GPIO9 */
    HBN_OUT0_INT_GPIO10 = 1, /*!< HBN out 0 interrupt type: GPIO10 */
    HBN_OUT0_INT_GPIO11 = 2, /*!< HBN out 0 interrupt type: GPIO11 */
    HBN_OUT0_INT_GPIO12 = 3, /*!< HBN out 0 interrupt type: GPIO12 */
    HBN_OUT0_INT_GPIO13 = 4, /*!< HBN out 0 interrupt type: GPIO13 */
    HBN_OUT0_INT_GPIO30 = 5, /*!< HBN out 0 interrupt type: GPIO30 */
    HBN_OUT0_INT_GPIO31 = 6, /*!< HBN out 0 interrupt type: GPIO31 */
    HBN_OUT0_INT_GPIO8 = 7,  /*!< HBN out 0 interrupt type: GPIO8 */
    HBN_OUT0_INT_GPIO14 = 8, /*!< HBN out 0 interrupt type: GPIO14 */
    HBN_OUT0_INT_GPIO22 = 9, /*!< HBN out 0 interrupt type: GPIO22 */
    HBN_OUT0_INT_RTC = 16,   /*!< HBN out 0 interrupt type: RTC */
    HBN_OUT0_INT_MAX,        /*!< HBN out 0 max num */
};
typedef BL_ENUM_Type HBN_OUT0_INT_Type;

/**
 *  @brief HBN OUT0 interrupt type definition
 */
enum {
    HBN_OUT1_INT_BOD,    /*!< HBN out 1 interrupt type: BOD */
    HBN_OUT1_INT_ACOMP0, /*!< HBN out 1 interrupt type: ACOMP0 */
    HBN_OUT1_INT_ACOMP1, /*!< HBN out 1 interrupt type: ACOMP1 */
    HBN_OUT1_INT_MAX,    /*!< HBN out 1 max num */
};
typedef BL_ENUM_Type HBN_OUT1_INT_Type;

/**
 *  @brief HBN LDO level type definition
 */
enum {
    HBN_LDO11_LEVEL_0P60V = 0,  /*!< VDD11_AON voltage 0.60V */
    HBN_LDO11_LEVEL_0P65V = 1,  /*!< VDD11_AON voltage 0.65V */
    HBN_LDO11_LEVEL_0P70V = 2,  /*!< VDD11_AON voltage 0.70V */
    HBN_LDO11_LEVEL_0P75V = 3,  /*!< VDD11_AON voltage 0.75V */
    HBN_LDO11_LEVEL_0P80V = 4,  /*!< VDD11_AON voltage 0.80V */
    HBN_LDO11_LEVEL_0P85V = 5,  /*!< VDD11_AON voltage 0.85V */
    HBN_LDO11_LEVEL_0P90V = 6,  /*!< VDD11_AON voltage 0.90V */
    HBN_LDO11_LEVEL_0P95V = 7,  /*!< VDD11_AON voltage 0.95V */
    HBN_LDO11_LEVEL_1P00V = 8,  /*!< VDD11_AON voltage 1.00V */
    HBN_LDO11_LEVEL_1P05V = 9,  /*!< VDD11_AON voltage 1.05V */
    HBN_LDO11_LEVEL_1P10V = 10, /*!< VDD11_AON voltage 1.10V */
};
typedef BL_ENUM_Type HBN_LDO11_LEVEL_Type;

/**
 *  @brief HBN LDO level type definition
 */
enum {
    HBN_LDO_LEVEL_0P60V = 0,  /*!< HBN LDO voltage 0.60V */
    HBN_LDO_LEVEL_0P65V = 1,  /*!< HBN LDO voltage 0.65V */
    HBN_LDO_LEVEL_0P70V = 2,  /*!< HBN LDO voltage 0.70V */
    HBN_LDO_LEVEL_0P75V = 3,  /*!< HBN LDO voltage 0.75V */
    HBN_LDO_LEVEL_0P80V = 4,  /*!< HBN LDO voltage 0.80V */
    HBN_LDO_LEVEL_0P85V = 5,  /*!< HBN LDO voltage 0.85V */
    HBN_LDO_LEVEL_0P90V = 6,  /*!< HBN LDO voltage 0.90V */
    HBN_LDO_LEVEL_0P95V = 7,  /*!< HBN LDO voltage 0.95V */
    HBN_LDO_LEVEL_1P00V = 8,  /*!< HBN LDO voltage 1.00V */
    HBN_LDO_LEVEL_1P05V = 9,  /*!< HBN LDO voltage 1.05V */
    HBN_LDO_LEVEL_1P10V = 10, /*!< HBN LDO voltage 1.10V */
    HBN_LDO_LEVEL_1P15V = 11, /*!< HBN LDO voltage 1.15V */
    HBN_LDO_LEVEL_1P20V = 12, /*!< HBN LDO voltage 1.20V */
    HBN_LDO_LEVEL_1P25V = 13, /*!< HBN LDO voltage 1.25V */
    HBN_LDO_LEVEL_1P30V = 14, /*!< HBN LDO voltage 1.30V */
    HBN_LDO_LEVEL_1P35V = 15, /*!< HBN LDO voltage 1.35V */
};
typedef BL_ENUM_Type HBN_LDO_LEVEL_Type;

/**
 *  @brief HBN LDO11RT drive strength type definition
 */
enum {
    HBN_LDO11RT_DRIVE_STRENGTH_5_50UA = 0,   /*!< HBN LDO11RT drive strength 0: 5uA to 50uA */
    HBN_LDO11RT_DRIVE_STRENGTH_10_100UA = 1, /*!< HBN LDO11RT drive strength 1: 10uA to 100uA */
    HBN_LDO11RT_DRIVE_STRENGTH_15_150UA = 2, /*!< HBN LDO11RT drive strength 2: 15uA to 150uA */
    HBN_LDO11RT_DRIVE_STRENGTH_25_250UA = 3, /*!< HBN LDO11RT drive strength 3: 25uA to 250uA */
};
typedef BL_ENUM_Type HBN_LDO11RT_DRIVE_STRENGTH_Type;

/**
 *  @brief HBN level type definition
 */
enum {
    HBN_LEVEL_0, /*!< HBN pd_core */
    HBN_LEVEL_1, /*!< HBN pd_aon_hbncore + pd_core */
    HBN_LEVEL_2, /*!< HBN pd_aon_hbnrtc + pd_aon_hbncore + pd_core */
};
typedef BL_ENUM_Type HBN_LEVEL_Type;

/**
 *  @brief HBN BOR configuration type definition
 */
typedef struct
{
    uint8_t enableBor;      /*!< Enable BOR or not */
    uint8_t enableBorInt;   /*!< Enable BOR interrupt or not */
    uint8_t borThreshold;   /*!< BOR threshold */
    uint8_t enablePorInBor; /*!< Enable POR when BOR occure or not */
} HBN_BOR_CFG_Type;

/**
 *  @brief HBN APP configuration type definition
 */
typedef struct
{
    uint8_t useXtal32k;           /*!< Whether use xtal 32K as 32K clock source,otherwise use rc32k */
    uint32_t sleepTime;           /*!< HBN sleep time */
    uint8_t hw_pu_pd_en;          /*!< Pull up or pull down enable in the hbn mode */
    spi_flash_cfg_type *flashCfg; /*!< Flash config pointer, used when power down flash */
    HBN_LEVEL_Type hbnLevel;      /*!< HBN level */
    HBN_LDO_LEVEL_Type ldoLevel;  /*!< LDO level */
} HBN_APP_CFG_Type;

/*@} end of group HBN_Public_Types */

/** @defgroup  HBN_Public_Constants
 *  @{
 */

